ГТС/УТГТС/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупкаПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПерепоставленного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерепоставленноеДарится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопоставкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяДопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачаНеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьСейчас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходоватьСейчас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяСписаниеДопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОприходование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОприходованиеВозврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьПереходПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьПереходПраваСобственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыОснованияАктаОРасхождении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОснованияАктаОРасхождении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТоваровСХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровХранителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаТоваровНаХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтХранителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровПереработчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваровОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТоваровКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СпособыОтраженияРасхожденийАктПриемкиКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОтраженияРасхожденийАктПриемкиКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиКакИсправлениеПервичныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировокКакНовыеПервичныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеПервичныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиПоСогласованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РасхожденияСервер.УправлениеСтраницамиВыборДействия(ЭтотОбъект, Параметры);
	
	ИспользоватьЗаявкиНаВозврат = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаВозвратТоваровОтКлиентов");
	ИспользоватьЗаказыКлиентов = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	ИспользоватьЗаказыНаПеремещение = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыНаПеремещение");
	КоличествоУпаковокРасхождения = Параметры.КоличествоУпаковокРасхождения;
	ГрупповоеИзменение = Параметры.ГрупповоеИзменение;
	ЭтоПереходПраваСобственности =
		(Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереходПраваСобственности);
	
	ЕстьРаспоряжениеОснованияОтгрузкаТоваровКлиенту = Параметры.ЕстьРаспоряжениеОснованияОтгрузкаТоваровКлиенту;
	
	Если Параметры.ОтгрузкаПринципалу
		Или Не ГрупповоеИзменение
			И КоличествоУпаковокРасхождения >= 0
			И (Параметры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа
				Или Параметры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Тогда
		Если ДействиеИзлишки = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ВозвратПерепоставленного Тогда
			ДействиеИзлишки = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПустаяСсылка();
		КонецЕсли;
		Элементы.ВозвратПерепоставленного.Доступность = Ложь;
	КонецЕсли;
	
	Если Не ГрупповоеИзменение Тогда
		Если КоличествоУпаковокРасхождения >= 0 Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.Излишки;
			ДействиеИзлишки = Параметры.ВыбранноеДействие;
		Иначе
			Элементы.Страницы.ТекущаяСтраница = Элементы.Недостачи;
			ДействиеНедостачи = Параметры.ВыбранноеДействие;
		КонецЕсли;
	КонецЕсли;
	
	Если ГрупповоеИзменение Тогда
		Заголовок = НСтр("ru='Как отработать расхождения'");
	Иначе
		Если КоличествоУпаковокРасхождения >= 0 Тогда
			Элементы.Недостачи.Видимость = Ложь;
			Заголовок = НСтр("ru='Как отработать излишек'");
		Иначе
			Элементы.Излишки.Видимость = Ложь;
			Заголовок = НСтр("ru='Как отработать недостачу'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КартинкаПояснения.Видимость = Параметры.ПоказыватьПояснение;
	Элементы.Пояснение.Видимость = Параметры.ПоказыватьПояснение;
	
	ВидимостьВариантовОприходованияСписания =
		Параметры.ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровКлиенту
		Или ЭтоПереходПраваСобственности
			И Параметры.СпособОтраженияРасхождений =
				Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов;
	
	ВидимостьВариантаОформить =
		Не ЭтоПереходПраваСобственности
		Или Параметры.СпособОтраженияРасхождений =
			Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов;
	
	// Оформить
	Элементы.ДопоставкаНеТребуется.Видимость = ВидимостьВариантаОформить;
	Элементы.ДопоставкаНеТребуетсяДекорация.Видимость = ВидимостьВариантаОформить;
	
	Элементы.ПокупкаПерепоставленного.Видимость = ВидимостьВариантаОформить;
	Элементы.ПокупкаПерепоставленногоДекорация.Видимость = ВидимостьВариантаОформить;
	
	// Списать за наш счет
	Элементы.ТребуетсяСписание.Видимость = ВидимостьВариантовОприходованияСписания;
	Элементы.ТребуетсяСписаниеДекорация.Видимость = ВидимостьВариантовОприходованияСписания;
	
	// Списать за наш счет и допоставить
	Элементы.ТребуетсяСписаниеДопоставка.Видимость = ВидимостьВариантовОприходованияСписания
		И Не ЕстьРаспоряжениеОснованияОтгрузкаТоваровКлиенту;
	Элементы.ТребуетсяСписаниеДопоставкаДекорация.Видимость = ВидимостьВариантовОприходованияСписания
		И Не ЕстьРаспоряжениеОснованияОтгрузкаТоваровКлиенту;
	
	// Отнести на доходы
	Элементы.ТребуетсяОприходование.Видимость = ВидимостьВариантовОприходованияСписания;
	Элементы.ТребуетсяОприходованиеДекорация.Видимость = ВидимостьВариантовОприходованияСписания;
	
	// Отнести на доходы и вернуть
	Элементы.ТребуетсяОприходованиеВозврат.Видимость = ВидимостьВариантовОприходованияСписания;
	Элементы.ТребуетсяОприходованиеВозвратДекорация.Видимость = ВидимостьВариантовОприходованияСписания;
	
	// Изменить переход права собственности
	Элементы.УменьшитьПереходПраваСобственности.Видимость = ЭтоПереходПраваСобственности;
	Элементы.УменьшитьПереходПраваСобственностиДекорация.Видимость = ЭтоПереходПраваСобственности;
	
	Элементы.УвеличитьПереходПраваСобственности.Видимость = ЭтоПереходПраваСобственности;
	Элементы.УвеличитьПереходПраваСобственностиДекорация.Видимость = ЭтоПереходПраваСобственности;
	
	СформироватьЗаголовки(
		Параметры.ТипАкта,
		Параметры.КоличествоУпаковокРасхождения,
		Параметры.СпособОтраженияРасхождений,
		Параметры.ГрупповоеИзменение,
		Параметры.СтрокаПоЗаказу);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие И Модифицированность И НЕ ЗавершениеРаботы Тогда
		
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
		               НСтр("ru='Выполненные изменения будут утеряны. Все равно закрыть?'"),
		               РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыполняетсяЗакрытие = Истина;
	
	Если ГрупповоеИзменение Тогда
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("ДействиеИзлишки", ДействиеИзлишки);
		ПараметрыЗакрытия.Вставить("ДействиеНедостачи", ДействиеНедостачи);
		Закрыть(ПараметрыЗакрытия);
	ИначеЕсли КоличествоУпаковокРасхождения > 0 Тогда
		Закрыть(ДействиеИзлишки);
	ИначеЕсли КоличествоУпаковокРасхождения < 0 Тогда
		Закрыть(ДействиеНедостачи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть(Неопределено);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьЗаголовки(ТипАкта, КоличествоУпаковокРасхождения, СпособОтраженияРасхождений, ГрупповоеИзменение, СтрокаПоЗаказу)
	
	Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.РеализацияТоваровУслуг Тогда
		
		СформироватьЗаголовкиАктРеализация(СпособОтраженияРасхождений, ГрупповоеИзменение, СтрокаПоЗаказу);
	
	ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровКлиенту Тогда
		
		СформироватьЗаголовкиАктОтгрузкаТоваровКлиенту(СпособОтраженияРасхождений, ГрупповоеИзменение, СтрокаПоЗаказу);
		
	ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ВозвратПоставщику Тогда
		
		СформироватьЗаголовкиАктВозврат();
		
	ИначеЕсли ТипАкта = "Перемещение" Тогда
		
		СформироватьЗаголовкиАктПеремещение(ГрупповоеИзменение, СтрокаПоЗаказу);
		
	ИначеЕсли РасхожденияКлиентСервер.ТипОснованияПередачаТоваровХранителю(ТипАкта)
		Или РасхожденияКлиентСервер.ТипОснованияПередачаНаКомиссию(ТипАкта) Тогда
		
		СформироватьЗаголовкиАктПередача(СпособОтраженияРасхождений, ТипАкта, ГрупповоеИзменение, СтрокаПоЗаказу);
		
	ИначеЕсли ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ОтгрузкаТоваровСХранения Тогда
		
		СформироватьЗаголовкиАктОтветственноеХранение(СпособОтраженияРасхождений);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиАктРеализация(СпособОтраженияРасхождений, ГрупповоеИзменение, СтрокаПоЗаказу)

	// НЕДОСТАЧИ
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при реализации согласованы с клиентом'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при реализации не согласованы с клиентом'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		
		// Переоформить переход права собственности
		Элементы.УменьшитьПереходПраваСобственностиДекорация.Заголовок = НСтр("ru = 'Переход права собственности уменьшается корректировкой реализации (исправление) на недопоставленный товар.'");
		
		// Оформить
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление).'");
		
		// Оформить и допоставить
		Если ЭтоПереходПраваСобственности Тогда
			
			Если Элементы.ТребуетсяДопоставка.СписокВыбора.Количество() > 0 Тогда
				Элементы.ТребуетсяДопоставка.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить переход права собственности и допоставить'");
			КонецЕсли;
			
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара.'");
			
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением реализации недопоставленного товара.'");
		КонецЕсли;
		
	ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию Тогда
		
		// Переоформить переход права собственности
		Элементы.УменьшитьПереходПраваСобственностиДекорация.Заголовок = НСтр("ru = 'Переход права собственности уменьшается корректировкой реализации (по согласованию сторон) на недопоставленный товар.'");
		
		// Оформить
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон).'");
		
		// Оформить и допоставить
		Если ЭтоПереходПраваСобственности Тогда
			
			Если Элементы.ТребуетсяДопоставка.СписокВыбора.Количество() > 0 Тогда
				Элементы.ТребуетсяДопоставка.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить переход права собственности и допоставить'");
			КонецЕсли;
			
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением отгрузки товаров клиенту недопоставленного товара.'");
			
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением реализации недопоставленного товара'");
		КонецЕсли;
		
	ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы Тогда
		
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (возврат недопоставленного товара).'");
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'На недопоставленный товар оформляется корректировка реализации (возврат недопоставленного товара) с последующим оформлением реализации на допоставку.'");
		
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Переоформить переход права собственности
		Элементы.УменьшитьПереходПраваСобственностиДекорация.Заголовок
			= НСтр("ru = 'Переход права собственности уменьшается на недопоставленный товар, отгрузка товаров клиенту не изменяется.'");
		
		// Оформить
		Если ЭтоПереходПраваСобственности Тогда
			
			Если Элементы.ДопоставкаНеТребуется.СписокВыбора.Количество() > 0 Тогда
				Элементы.ДопоставкаНеТребуется.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить все документы'");
			КонецЕсли;
			
			Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыКлиентов) Тогда
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту и переход права собственности уменьшаются на недопоставленный товар с последующей отменой недопоставленных строк заказа.'");
			Иначе
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту и переход права собственности уменьшаются на недопоставленный товар.'");
			КонецЕсли;
			
		Иначе
			
			Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыКлиентов) Тогда
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа.'");
			Иначе
				Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Реализация уменьшается на недопоставленный товар.'");
			КонецЕсли;
			
		КонецЕсли;
		
		// Оформить и допоставить
		Если ЭтоПереходПраваСобственности Тогда
			
			Если Элементы.ТребуетсяДопоставка.СписокВыбора.Количество() > 0 Тогда
				Элементы.ТребуетсяДопоставка.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить все документы и допоставить'");
			КонецЕсли;
			
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'Отгрузка товаров клиенту и переход права собственности уменьшаются на недопоставленный товар с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара.'");
			
		Иначе
			Элементы.ТребуетсяДопоставкаДекорация.Заголовок
				= НСтр("ru = 'Реализация уменьшается на недопоставленный товар с последующим оформлением новой реализации недопоставленного товара.'");
		КонецЕсли;
		
		// Списать за наш счет
		Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыКлиентов) Тогда
			Элементы.ТребуетсяСписаниеДекорация.Заголовок
				= НСтр("ru = 'Переход права собственности уменьшается на недопоставленный товар, расхождения списываются ""из пути"" и относятся на прочие расходы с отменой недопоставленных строк заказа.'");
		Иначе
			Элементы.ТребуетсяСписаниеДекорация.Заголовок
				= НСтр("ru = 'Переход права собственности уменьшается на недопоставленный товар, расхождения списываются ""из пути"" и относятся на прочие расходы.'");
		КонецЕсли;
		
		// Списать за наш счет и допоставить
		Элементы.ТребуетсяСписаниеДопоставкаДекорация.Заголовок
			= НСтр("ru = 'Переход права собственности уменьшается на недопоставленный товар, расхождения списываются ""из пути"" и относятся на прочие расходы с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара.'");
		
	КонецЕсли;
	
	// Допоставить без оформления
	Если ЭтоПереходПраваСобственности Тогда
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Неотгруженный товар отгружается со склада, документы не переоформляются.'");
	Иначе
		Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются.'");
	КонецЕсли;

	// Не признавать
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются.'");
	
	// ИЗЛИШКИ
	
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при реализации согласованы с клиентом'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при реализации не согласованы с клиентом'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		
		// Переоформить переход права собственности
		Элементы.УвеличитьПереходПраваСобственностиДекорация.Заголовок = НСтр("ru = 'Переход права собственности увеличивается корректировкой реализации (исправление) на перепоставленный товар.'");
		
		// Оформить
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление).'");
		
		// Оформить и вернуть
		Если ЭтоПереходПраваСобственности Тогда
		
			Если Элементы.ВозвратПерепоставленного.СписокВыбора.Количество() > 0 Тогда
				Элементы.ВозвратПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить переход права собственности и вернуть'");
			КонецЕсли;
		
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением новой корректировки реализации на возврат перепоставленного товара ""в путь"".'");
		
		Иначе
			
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением заявки на возврат перепоставленного товара.'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (исправление) с последующим оформлением возврата перепоставленного товара.'");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиПоСогласованию Тогда
		
		// Переоформить переход права собственности
		Элементы.УвеличитьПереходПраваСобственностиДекорация.Заголовок = НСтр("ru = 'Переход права собственности увеличивается корректировкой реализации (по согласованию сторон) на перепоставленный товар.'");
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон).'");
		
		// Оформить и вернуть
		Если ЭтоПереходПраваСобственности Тогда
			
			Если Элементы.ВозвратПерепоставленного.СписокВыбора.Количество() > 0 Тогда
				Элементы.ВозвратПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить переход права собственности и вернуть'");
			КонецЕсли;
			
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением новой корректировки реализации на возврат перепоставленного товара ""в путь"".'");
			
		Иначе
			
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением заявки на возврат перепоставленного товара.'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (по согласованию сторон) с последующим оформлением возврата перепоставленного товара.'");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировокКакНовыеПервичныеДокументы Тогда
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного).'");
		Если ИспользоватьЗаявкиНаВозврат Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного товара) с последующим оформлением заявки на возврат перепоставленного товара.'");
		Иначе
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'На перепоставленный товар оформляется корректировка реализации (реализация перепоставленного товара) с последующим оформлением возврата перепоставленного товара.'");
		КонецЕсли;
		
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Переоформить переход права собственности
		Элементы.УвеличитьПереходПраваСобственностиДекорация.Заголовок
			= НСтр("ru = 'Переход права собственности увеличивается на перепоставленный товар, отгрузка товаров клиенту не изменяется.'");
		
		// Оформить
		Если ЭтоПереходПраваСобственности Тогда
			
			Если Элементы.ПокупкаПерепоставленного.СписокВыбора.Количество() > 0 Тогда
				Элементы.ПокупкаПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить все документы'");
			КонецЕсли;
			
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Отгрузка товаров клиенту и переход права собственности увеличиваются на перепоставленный товар.'");
			
		Иначе
			Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар.'");
		КонецЕсли;
		
		// Оформить и вернуть
		Если ЭтоПереходПраваСобственности Тогда
			
			Если Элементы.ВозвратПерепоставленного.СписокВыбора.Количество() > 0 Тогда
				Элементы.ВозвратПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить все документы и вернуть'");
			КонецЕсли;
			
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Отгрузка товаров клиенту и переход права собственности увеличиваются на перепоставленный товар с последующим оформлением корректировки реализации на возврат перепоставленного товара ""в путь"".'");
			
		Иначе
			
			Если ИспользоватьЗаявкиНаВозврат Тогда
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар с последующим оформлением заявки на возврат перепоставленного товара.'");
			Иначе
				Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Реализация увеличивается на перепоставленный товар с последующим оформлением возврата перепоставленного товара.'");
			КонецЕсли;
			
		КонецЕсли;
		
		// Отнести на доходы
		Элементы.ТребуетсяОприходованиеДекорация.Заголовок
			= НСтр("ru = 'Расхождения оприходуются ""в путь"", переход права собственности увеличивается на перепоставленный товар.'");
		
		// Отнести на доходы и вернуть
		Элементы.ТребуетсяОприходованиеВозвратДекорация.Заголовок
			= НСтр("ru = 'Расхождения оприходуются ""в путь"" с возможностью дальнейшего возврата клиентом, переход права собственности увеличивается на перепоставленный товар.'");
		
	КонецЕсли;
	
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются.'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются.'");

КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиАктОтгрузкаТоваровКлиенту(СпособОтраженияРасхождений, ГрупповоеИзменение, СтрокаПоЗаказу)

	// НЕДОСТАЧИ
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при отгрузке согласованы с клиентом'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при отгрузке не согласованы с клиентом'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		
		// Оформить
		Если Элементы.ДопоставкаНеТребуется.СписокВыбора.Количество() > 0 Тогда
			Элементы.ДопоставкаНеТребуется.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку товаров клиенту'");
		КонецЕсли;
		
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
			= НСтр("ru = 'На недопоставленный товар оформляется исправление отгрузки товаров клиенту.'");
		
		// Оформить и допоставить
		Если Элементы.ТребуетсяДопоставка.СписокВыбора.Количество() > 0 Тогда
			Элементы.ТребуетсяДопоставка.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку товаров клиенту и допоставить'");
		КонецЕсли;
		
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок
			= НСтр("ru = 'На недопоставленный товар оформляется исправление отгрузки товаров клиенту с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара.'");
		
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Оформить
		Если Элементы.ДопоставкаНеТребуется.СписокВыбора.Количество() > 0 Тогда
			Элементы.ДопоставкаНеТребуется.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку'");
		КонецЕсли;
		
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров клиенту уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа.'");
		
		// Оформить и допоставить
		Если Элементы.ТребуетсяДопоставка.СписокВыбора.Количество() > 0 Тогда
			Элементы.ТребуетсяДопоставка.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку товаров клиенту и допоставить'");
		КонецЕсли;
		
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров клиенту уменьшается на недопоставленный товар с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара.'");
		
	КонецЕсли;
	
	// Списать за наш счет
	Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыКлиентов) Тогда
		Элементы.ТребуетсяСписаниеДекорация.Заголовок = НСтр("ru = 'Расхождения списываются ""из пути"" и относятся на прочие расходы с отменой недопоставленных строк заказа.'");
	Иначе
		Элементы.ТребуетсяСписаниеДекорация.Заголовок = НСтр("ru = 'Расхождения списываются ""из пути"" и относятся на прочие расходы.'");
	КонецЕсли;
	
	// Списать за наш счет и допоставить
	Элементы.ТребуетсяСписаниеДопоставкаДекорация.Заголовок
		= НСтр("ru = 'Расхождения списываются ""из пути"" и относятся на прочие расходы с последующим оформлением новой отгрузки товаров клиенту недопоставленного товара.'");
	
	// Допоставить без оформления
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются, реализация оформляется без учета расхождений.'");
	
	// Не признавать
	Если Элементы.НедостачаНеПризнана.СписокВыбора.Количество() > 0 Тогда
		Элементы.НедостачаНеПризнана.СписокВыбора[0].Представление = НСтр("ru = 'Не признавать и не учитывать расхождения в реализации'");
	КонецЕсли;
	
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Расхождения не признаются, документы не переоформляются, реализация оформляется без учета расхождений.'");
	
	// ИЗЛИШКИ
	
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при отгрузке согласованы с клиентом'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при отгрузке не согласованы с клиентом'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		
		// Оформить
		Если Элементы.ПокупкаПерепоставленного.СписокВыбора.Количество() > 0 Тогда
			Элементы.ПокупкаПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку товаров клиенту'");
		КонецЕсли;
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'На перепоставленный товар оформляется исправление отгрузки товаров клиенту.'");
		
		// Оформить и вернуть
		Если Элементы.ВозвратПерепоставленного.СписокВыбора.Количество() > 0 Тогда
			Элементы.ВозвратПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку товаров клиенту и вернуть'");
		КонецЕсли;
		
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'На перепоставленный товар оформляется исправление отгрузки товаров клиенту с последующим оформлением возврата перепоставленного товара.'");
		
	Иначе // Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ИсправлениеПервичныхДокументов
		
		// Оформить
		Если Элементы.ПокупкаПерепоставленного.СписокВыбора.Количество() > 0 Тогда
			Элементы.ПокупкаПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку товаров клиенту'");
		КонецЕсли;
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров клиенту увеличивается на перепоставленный товар.'");
		
		// Оформить и вернуть
		Если Элементы.ВозвратПерепоставленного.СписокВыбора.Количество() > 0 Тогда
			Элементы.ВозвратПерепоставленного.СписокВыбора[0].Представление = НСтр("ru = 'Переоформить отгрузку товаров клиенту и вернуть'");
		КонецЕсли;
		
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров клиенту увеличивается на перепоставленный товар с последующим оформлением возврата перепоставленного товара.'");
		
	КонецЕсли;
	
	// Отнести на доходы
	Элементы.ТребуетсяОприходованиеДекорация.Заголовок = НСтр("ru = 'Расхождения оприходуются ""в путь"" с возможностью дальнейшей реализации клиенту.'");
	
	// Отнести на доходы и вернуть
	Элементы.ТребуетсяОприходованиеВозвратДекорация.Заголовок = НСтр("ru = 'Расхождения оприходуются ""в путь"" и возвращаются на склад.'");
	
	// Вернуть без оформления
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются, реализация оформляется без учета расхождений.'");

	// Не признавать
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются.'");

	Если Элементы.ПерепоставленноеДарится.СписокВыбора.Количество() > 0 Тогда
		Элементы.ПерепоставленноеДарится.СписокВыбора[0].Представление = НСтр("ru = 'Не признавать и не учитывать расхождения в реализации'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиАктВозврат()

	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при возврате согласованы с поставщиком'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при возврате не согласованы с поставщиком'");
	
	Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику уменьшается на недопоставленный товар'");
	Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику уменьшается на недопоставленный товар с последующим оформлением нового возврата недопоставленного товара'");
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при возврате согласованы с поставщиком'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при возврате не согласованы с поставщиком'");
	
	Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику увеличивается на перепоставленный товар'");
	Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Возврат товаров поставщику увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара'");
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются'");

КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиАктПеремещение(ГрупповоеИзменение, СтрокаПоЗаказу)
	
	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при поступлении согласованы с отправителем'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при поступлении не согласованы с отправителем'");
	
	Если СтрокаПоЗаказу Или (ГрупповоеИзменение И ИспользоватьЗаказыНаПеремещение) Тогда
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа'");
	Иначе
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар'");
	КонецЕсли;
	Элементы.ТребуетсяДопоставкаДекорация.Заголовок = НСтр("ru = 'Перемещение товаров уменьшается на недопоставленный товар с последующим оформлением нового перемещения недопоставленного товара'");
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада-отправителя, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада-отправителя, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при поступлении согласованы с отправителем'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при поступлении не согласованы с отправителем'");
	
	Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Перемещение товаров увеличивается на перепоставленный товар'");
	Элементы.ВозвратПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Перемещение товаров увеличивается на перепоставленный товар с последующим оформлением обратного перемещения перепоставленного товара'");
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад-отправитель, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад-отправитель, документы не переоформляются'");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиАктПередача(СпособОтраженияРасхождений, ТипАкта, ГрупповоеИзменение, СтрокаПоЗаказу)
	
	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при передаче согласованы с партнером'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при передаче не согласованы с партнером'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		
		Если СтрокаПоЗаказу
			Или (ГрупповоеИзменение
				И ИспользоватьЗаказыКлиентов) Тогда
			
			Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление) с последующей отменой недопоставленных строк заказа'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление) с последующей отменой недопоставленных строк заказа'");
			КонецЕсли;
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
			
		Иначе
			
			Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление)'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление)'");
			КонецЕсли;
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
			
		КонецЕсли;
		
		Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением новой передачи недопоставленного товара'");
		Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется передача хранителю (исправление) с последующим оформлением новой передачи недопоставленного товара'");
		КонецЕсли;
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = ТекстЗаголовка;
		
	Иначе
		
		Если СтрокаПоЗаказу
			Или (ГрупповоеИзменение
				И ИспользоватьЗаказыКлиентов) Тогда
			
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'Передача уменьшается на недопоставленный товар с последующей отменой недопоставленных строк заказа'");
			
		Иначе
			Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
				= НСтр("ru = 'Передача уменьшается на недопоставленный товар'");
		КонецЕсли;
		
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок
			= НСтр("ru = 'Передача уменьшается на недопоставленный товар с последующим оформлением новой передачи недопоставленного товара'");
		
	КонецЕсли;
	
	Элементы.НедостачаНеПризнанаДекорация.Заголовок
		= НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок
		= НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при передаче согласованы с партнером'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при передаче не согласованы с партнером'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление)'");
		
		Если ИспользоватьЗаявкиНаВозврат
		   Тогда
			Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением заявки на возврат перепоставленного товара'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением заявки на возврат перепоставленного товара'");
			КонецЕсли;
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
		Иначе
			Если ТипАкта = Перечисления.ТипыОснованияАктаОРасхождении.ПередачаНаКомиссию Тогда
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача на комиссию (исправление) с последующим оформлением поступления перепоставленного товара'");
			Иначе // Перечисления.ТипыОснованияАктаОРасхождении.ПередачаТоваровХранителю
				ТекстЗаголовка
					= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением поступления перепоставленного товара'");
			КонецЕсли;
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'На перепоставленный товар оформляется передача хранителю (исправление) с последующим оформлением поступления перепоставленного товара'");
		КонецЕсли;
		
	Иначе
		
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = НСтр("ru = 'Передача увеличивается на перепоставленный товар'");
		
		Если ИспользоватьЗаявкиНаВозврат
		   Тогда
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Передача увеличивается на перепоставленный товар с последующим оформлением заявки на возврат перепоставленного товара'");
		Иначе
			Элементы.ВозвратПерепоставленногоДекорация.Заголовок
				= НСтр("ru = 'Передача увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара'");
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок
		= НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок
		= НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются'");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовкиАктОтветственноеХранение(СпособОтраженияРасхождений)
	
	// Недостачи
	Элементы.ДекорацияНедостачиСогласованы.Заголовок   = НСтр("ru = 'Недостачи при отгрузке с ответственного хранения согласованы с поставщиком'");
	Элементы.ДекорацияНедостачиНеСогласованы.Заголовок = НСтр("ru = 'Недостачи при отгрузке с ответственного хранения не согласованы с поставщиком'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		Если Параметры.ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка принципалу (исправление)'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка поклажедателю (исправление)'");
		КонецЕсли;
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок = ТекстЗаголовка;
		Если Параметры.ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка принципалу (исправление) с последующим оформлением новой отгрузки недопоставленного товара'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На недопоставленный товар оформляется отгрузка поклажедателю (исправление) с последующим оформлением новой отгрузки недопоставленного товара'");
		КонецЕсли;
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок = ТекстЗаголовка;
	Иначе
		Элементы.ДопоставкаНеТребуетсяДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю уменьшается на недопоставленный товар'");
		Элементы.ТребуетсяДопоставкаДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю уменьшается на недопоставленный товар с последующим оформлением новой отгрузки недопоставленного товара'");
	КонецЕсли;
	
	Элементы.НедостачаНеПризнанаДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар не отгружается со склада, документы не переоформляются'");
	Элементы.ОтгрузитьСейчасДекорация.Заголовок = НСтр("ru = 'Недопоставленный товар отгружается со склада, документы не переоформляются'");
	
	// Излишки
	Элементы.ДекорацияИзлишкиСогласованы.Заголовок   = НСтр("ru = 'Излишки при отгрузке с ответственного хранения согласованы с поставщиком'");
	Элементы.ДекорацияИзлишкиНеСогласованы.Заголовок = НСтр("ru = 'Излишки при отгрузке с ответственного хранения не согласованы с поставщиком'");
	
	Если СпособОтраженияРасхождений = Перечисления.СпособыОтраженияРасхожденийАктПриемкиКлиента.ОформлениеКорректировкиКакИсправлениеПервичныхДокументов Тогда
		Если Параметры.ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка принципалу (исправление)'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка поклажедателю (исправление)'");
		КонецЕсли;
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
		Если Параметры.ОтгрузкаПринципалу Тогда
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка принципалу (исправление) с последующим оформлением поступления перепоставленного товара'");
		Иначе
			ТекстЗаголовка
				= НСтр("ru = 'На перепоставленный товар оформляется отгрузка поклажедателю (исправление) с последующим оформлением поступления перепоставленного товара'");
		КонецЕсли;
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок = ТекстЗаголовка;
	Иначе
		Элементы.ПокупкаПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю увеличивается на перепоставленный товар'");
		Элементы.ВозвратПерепоставленногоДекорация.Заголовок
			= НСтр("ru = 'Отгрузка товаров поклажедателю увеличивается на перепоставленный товар с последующим оформлением поступления перепоставленного товара'");
	КонецЕсли;
	
	Элементы.ПерепоставленноеДаритсяДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар не возвращается на склад, документы не переоформляются'");
	Элементы.ОприходоватьСейчасДекорация.Заголовок = НСтр("ru = 'Перепоставленный товар возвращается на склад, документы не переоформляются'");
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
